package quweijia.weather.info;

public class TaskInfo {
	
//	设计（论文）概述
	/**"基于Android平台的天气和空气质量服务系统共有四个方面：
	 * 天气预报方面、
	 * 空气质量方面、
	 * 变化趋势模块、
	 * 生活建议方面。
	 * 
	 * 天气预报方面实现天气情况，包括温度、湿度、风向和雨雪情况等。
	 * 空气质量方面实现现实空气质量情况，包括可入肺颗粒物、可吸入颗粒物、臭氧、二氧化硫和二氧化氮等。
	 * 趋势方面实现当前和未来几天的天气和空气质量情况。
	 * 生活建议方面根据当前的天气和空气质量情况提出合理的生活建议。
	 * 
	 * 
	 * 四个方面通过文字和图片的形式表现。
	 * 这些天气和空气质量数据是通过后台服务获取的，这个后台服务器按照一定的时间间隔，从Google上获取天气和空气质量信息，
	 * 并将空气质量信息保存在后台服务器中。
	 * 该系统开发环境为（工具）：Eclipse、JDK、Android、数据库（可选），
	 * 实现功能：通过本系统可以查看全国各大主要城市的天气和空气质量情况的信息，并获得相应的生活建议。
	 * 本设计希望学生能够根据实际项目的需求，准确地分析Andriod应用程序开发可能涉及的知识点，
	 * 通过分析软件的需求，快速设计用户界面和模块结构及功能，并最终完成应用程序的开发和测试。
	*/
	
	
//	设计（论文）工作内容
	/*
	"基于Android平台的天气和空气质量服务系统的设计与实现,本毕业设计系统为Android手机开发，
	主要采用服务器端jsp和sqlserver等，
	客户端使用android开发等,
	其主要工作内容如下三个模块：                                                          
	（1）天气预报模块
	（2）空气质量服务模块
	（3）生活与出行建议模块                                                             
	天气预报模块提供当日及未来几天的天气情况，包括雨雪、温度、湿度、风力等；
	空气质量服务模块提供当日及未来几天的空气质量情况，
	包括：可入肺颗粒物、可吸入颗粒物、臭氧、二氧化硫和二氧化氮等；
	生活与出行建议模块根据当前天气与空气情况及可能的变化，提供合理的生活建议。                               
	 分析模块的的内部功能，这些功能是程序正常运行的基础。
	 在显示天气情况、空气质量情况的用户界面中，为了在界面上显示相应信息，需要有从互联网获取空气质量数据的功能，
	 并将这些数据保存在程序的内部。
	 生活建议的模块中，需要有根据不同天气和空气质量情况提供不同信息提示的功能。
	 该系统服务覆盖全国各大主要城市，可以切换到任一城市进行查询。
	"				
*/
	
//	设计（论文）工作基本要求
	
/*	
	"毕业设计的主要内容安排如下：                                                                                                                              
    1、基于Andriod平台的空气质量系统的设计与实现的研发背景、目标及研究现状。
	2、探讨本系统在系统分析、设计和实现过程中采用的技术平台和相关Andriod开发技术。
	3、论述系统的需求调研、分析过程，明确系统的功能需求。
	4、对系统总体架构、功能模块结构及数据库结构进行设计。
	5、论述系统的具体实现过程。
	6、总结，对本文研究的课题及技术进行了展望和总结。
	"				
*/



}
